# Importing necessary libraries

In [5]:
import pandas as pd
import numpy as np
import os

# Define the path to the folder where your data is stored

In [6]:
path=r'/Users/urvi/Desktop/Instacart Basket Analysis/'
path

'/Users/urvi/Desktop/Instacart Basket Analysis/'

# Load the customers data

In [7]:
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# Check the first few rows to understand the data structure

In [8]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Check the shape of the dataframe to understand the size

In [9]:
df_customers.shape

(206209, 10)

# Rename columns for clarity

In [10]:
df_customers.rename(columns={
    'Surnam':'Last Name',
    'STATE':'State',
    'n_dependants':'Number of Dependents',
    'fam_status': 'Familial Status'
},inplace=True)

In [11]:
df_customers.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,Number of Dependents,Familial Status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Check for missing values

In [12]:
df_customers.isnull().sum()

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
date_joined                 0
Number of Dependents        0
Familial Status             0
income                      0
dtype: int64

# Fill missing values in the 'First Name' column with 'Unknown'

In [13]:
df_customers['First Name'].fillna('Unknown', inplace=True)

# Checking for duplicat rows in the customer dataframe

In [14]:
df_customers.duplicated().sum()

0

# Dropping duplicates if any exist

In [15]:
df_customers.drop_duplicates(inplace=True)

# Changing the data type of 'user_id' to string for meaning purposes

In [16]:
df_customers['user_id']=df_customers['user_id'].astype('str')

# Load the orders and products grouped data

In [17]:
df_ords_prods=pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data','ords_prods_grouped.pkl'))

In [18]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                int64
 6   user_id                 int64
 7   order_number            int64
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int64
 13  reordered               int64
 14  _merge                  category
 15  price_range_loc         object
 16  busiest_day             object
 17  busiest_days            object
 18  busiest_period_of_day   object
 19  max_order               int64
 20  loyalty_flag            object
 21  average spent           float64
 22  spending flag           object
 23  regularity              float64
 24  order frequency flag    object
dtypes: bool(1), category(1), float64(4), int64(11), object(8)
memory usage: 5.6+ GB

# Ensuring 'user_id'and 'order_id' in df_ords_prods is also a string type for a consistent merge

In [19]:
df_ords_prods['user_id']=df_ords_prods['user_id'].astype('str')

In [20]:
df_ords_prods['order_id']=df_ords_prods['order_id'].astype('str')

In [21]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                object
 6   user_id                 object
 7   order_number            int64
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int64
 13  reordered               int64
 14  _merge                  category
 15  price_range_loc         object
 16  busiest_day             object
 17  busiest_days            object
 18  busiest_period_of_day   object
 19  max_order               int64
 20  loyalty_flag            object
 21  average spent           float64
 22  spending flag           object
 23  regularity              float64
 24  order frequency flag    object
dtypes: bool(1), category(1), float64(4), int64(9), object(10)
memory usage: 5.6+ GB

# Drop the _merge column from the df_ords_prods dataframe as it is not needed

In [22]:
df_ords_prods = df_ords_prods.drop(columns = ['_merge'])

In [23]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                object
 6   user_id                 object
 7   order_number            int64
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int64
 13  reordered               int64
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  average spent           float64
 21  spending flag           object
 22  regularity              float64
 23  order frequency flag    object
dtypes: bool(1), float64(4), int64(9), object(10)
memory usage: 5.6+ GB

# Merge the customers dataframe with the orders_products grouped dataframe

In [24]:
df_ords_prods_all = df_ords_prods.merge(df_customers, on=['user_id'], indicator=True)

# Check the frequency of the new dataframe

In [26]:
df_ords_prods_all['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [28]:
df_ords_prods_all.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,First Name,Last Name,Gender,State,Age,date_joined,Number of Dependents,Familial Status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both

# Dropping the '_merge' column as it's no longer needed after verification

In [29]:
df_ords_prods_all.drop(columns='_merge', inplace=True)

In [30]:
df_ords_prods_all.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,order frequency flag,First Name,Last Name,Gender,State,Age,date_joined,Number of Dependents,Familial Status,income
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620

# Exporting the final merged dataframe to a pickle file for future use

In [31]:
df_ords_prods_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))